#!/usr/bin/env python3.5.2
# -*- coding: utf-8 -*-
steel_type = {
    "1": "弹簧钢",
    "2": "冷墩拉丝",
}
predict_method = {
    "linear_regression": "线性回归",
    "random_forest": "随机森林",
    "elm": "超限学习机elm",
    "svm": "支持向量机svm",
    # "BP":"BP神经网络",
}
# time_scale = {
# 	"day":"日",
# 	"week":"周",
# 	"halfmonth":"半月",
# 	"month":"月",
# 	"threemonth":"季度",
# 	"halfyear":"半年",
# 	"year":"年",
# }

INFO = "描述信息：以2016年1月以前的历史数据外延预测2016年1月之后的价格数据。"

WARNING = "数据处理耗时较长，请耐心等待..."

model_classname = {
    "elm": "ExtremeLM",
    "svm": "SVM",
    "BP": "BP",
    "linear_regression": "LR",
    "random_forest": "RandomForest",
}

# 铁矿石参数
iron_type = {
    "tkszs": "铁矿石指数",
    "price_qingdao": "到岸价",
}
stone_predict_method = {
    "logistic_regression": "逻辑回归",
    "random_forest": "随机森林",
    "elm": "超限学习机elm",
    "svm": "支持向量机svm",
}
time_scale = {
    "day": "日",
    "month": "月",
}

yinsu_type = {
    "tkszs_qdg": "铁矿石指数",
    "psjgzs": "普氏价格指数",
    "meiyuan": "美元指数",
    "tegang_zonghe_zhishu": "特钢综合指数",
    "pugang_zhishu": "普刚指数",
    "haiyun_BDI": "波罗的海指数",
    "haiyun_BDTI": "波罗的海原油指数",
    "feigang": "废钢价格",
    "WTI": "WTI原油价格",
}

choose_col_meaning = {
    'steeltype': '钢材种类（小类）',
    'tradeno': '钢材牌号',
    'delivery': '工艺',
    'specification': '规格',
    'factory': '工厂',
    'region': '地区'
}

all_select = {'region': ['全国', '重庆', '杭州', '长沙', '无锡', '常州', '上海', '南京', '北京', '西安', '武汉', '成都', '沈阳'],
              'steeltype': ['弹簧钢', '弹簧圆钢', '弹簧扁钢', '弹簧盘条'],
              'tradeno': ['65Mn', '60Si2Mn', '60Si2MnA', '60Si2CrA', '50CrVA', '55SiCrA', '55CrVA', '60Si2Cr',
                          '60Si2CrV',
                          '55SiCr', '55CrSi', '60Si2Mn(线)', '65Si2Mn(线)', '55SiCr(线)', '65Mn(线)', '60Si2MnA(线)',
                          '55SiCr(线）',
                          '60Si2MnA（线）', '55SiCr（线）', '65Mn（弹簧标准）', '65Mn模铸', '65Mn（线）', '60Si2MnA（弹簧标准）',
                          '60Si2MnA（退火）',
                          '50CrVA（退火）', '65Mn（退火）', '65Mn（卷板）', '60Si2Mn(模)', '60Si2Mn(扁）', '50CrVA(扁)', '60Si2MnA模铸',
                          '65Si2MnA(线)', '50CrV'], 'delivery': ['热轧', '冷轧', '模铸', '弹簧标准', 'GB/T699-1999', None],
              'factory': ['济源钢铁', '安钢', '鞍钢', '宝钢', '沙钢', '南钢', '邢钢', '中天', '中天钢铁', '邢台', '济源', '重庆钢铁', '鞍钢股份', '新冶特钢',
                          '宝钢特材',
                          '兴澄特钢', '西宁特钢', '淮钢特钢', '鄂钢', '首钢股份', '杭钢', '首钢贵钢', '大连特钢', '抚顺特钢', '石钢', '新余特钢', '邢台钢铁',
                          '西宁', '韩国浦项',
                          '上钢三厂', '重特', '淮钢', '宝特', '兴澄', '抚钢', '首钢', '新冶', '贵钢', '东特', '广钢', '新余', '湘钢', '大冶', '长特',
                          '宝钢特钢'],
              'specification': ['Φ5.5', 'Φ6.5-20', 'Φ6.5-25', 'Φ6.5-26', 'Φ10-12', 'Φ6.5-12', 'Φ13-180', 'Φ5.5-16',
                                'Φ6.5-14',
                                'Φ6.5-15.5', 'Φ50-130', 'Φ5.5-14', 'Φ20-50', '3.0*1250*2500', '（3.5-8）*1250*2500',
                                'Φ16-30',
                                'Φ30-60', '（10-25）*1000*2000', 'Φ60-100', '2.6*1260*2500', '3.0*1250*C',
                                '（3.5-10）*1250*C',
                                '（3.5-8.0）*1260*4000', '8.0*2000*10000', '9.0*2000*8000', 'Φ16-50', 'Φ6.5', 'Ф5.5-14',
                                'Ф13',
                                'Ф6.5-14', 'Φ12-100', 'Φ12-20', 'Φ21-40', 'Φ41-100', 'Φ21-50', 'Φ25-33', 'Φ33-53',
                                'Ф6.5-12',
                                'Φ50-80', 'Φ30-75', 'Φ20', 'Φ12-50', '3.4*1250*C', '4.0*1250*C', '5.0*1010*C',
                                '5.0*1250*C',
                                '6.0*1250*C', '(3.0-10)*1250*L', '(2.5-4.0)*1250*L', '(0.2-0.8)*1250*C',
                                '(1.0-3.0)*1250*C',
                                '(9.0-22)*1250*C', '(28-50)*1250*C', '(60-180)*1250*C', 'Φ5.5-20', 'Φ35-120', 'Φ16-40',
                                'Φ16-90',
                                'Φ60-90', 'Φ95-150', 'Φ13-80', '2.8*1250*C', '0.8*250*1250', '1.5*250*1250',
                                '4.0*240*1250',
                                '(12-35)*(75-220)', '2.5*1250*C', 'Ф12-16', '（2.0-3.0）*1000*2000', '3.5*1000*2000',
                                '1.0*1000*2000', '2.0*1000*2000', '4.0*1000*2000', 'φ20-50', 'φ12-50', '3.0*1260*4000',
                                '(3.5-10)*1250*C', '(3.5-8.0)*1260*4000', '(1.0-2.5)*1000*2000', '2.95*1250*2500',
                                '4.0*1250*1500', 'φ12-100', '(3.5-8)*1250*2500', '(10-25)*1000*2000',
                                '(2.0-3.0)*1000*2000',
                                'Ф5.5-20', 'Ф12-20', 'Ф21-40', 'Ф41-100', 'Ф21-50', 'φ16-50', 'φ6.5', 'Ф12-50',
                                'Ф12-100',
                                'Ф25-33', 'Ф33-53', 'Ф13-80', 'φ50-80', 'φ30-75', 'Ф30-75', 'Ф35-120', 'Ф16-50',
                                'Ф16-40',
                                'Ф50-80', 'Ф16-90', 'Ф60-90', 'Ф95-150', '2.0*1250*C', '08*250*1250', 'Ф20-50',
                                'Ф16-30',
                                'Ф30-60', 'Ф60-100', 'φ20', 'φ6.5-14', '6.5*1250*C', '(1.0-2.5)*1100*C',
                                '（1.0-2.5）*1100*C',
                                '3.0-10mm', '2.5-4.0mm', '0.2-0.8mm', '1.0-3.0mm', '9.0-22mm', '28-50mm', '60-180mm',
                                'Φ6.5-10.5', '(3-10)*1250*C', '3.0-10', '2.5-4.0', '0.2-0.8', '1.0-3.0', '9.0-22',
                                '28-50',
                                '60-180', 'Φ26-40', 'Φ40-100', 'Φ30-50', 'Φ10-30', 'Φ20-40', 'Φ16-150', 'Φ14', 'Φ16-48',
                                'Φ60-80', 'Φ38-75', 'Φ25-36模铸', 'Φ38-75模铸', 'Φ50', 'Φ10-20', 'Φ80-130', 'Φ20-90',
                                'Φ14-18',
                                'Φ12', 'Φ16-75', 'Φ80-90', 'Φ90－130', '5-25*50-150', 'Φ80-110', '5-10*50-60',
                                'Φ100-130', 'Φ60',
                                'Φ30']}

# 生成原始数据集
table_name = ['tkszs', 'meiyuan', 'steelprice', 'meitan_ljm', 'jkk_qingdao', 'fgzs', 'gtcl'] # 'tiejingfen'
table_name_all = ['rmbmyhl', 'CRU', 'jkk_qingdao_1', 'tksykcl', 'lwgcl', 'tegang_ yougang', 'wymzs', 'psjgzs',
                  'cugangyuedu', 'ljmzs', 'steelprice', 'tegang_buxiugang', 'PMI', 'PPI', 'gdzctz', 'pugang', 'dlmzs',
                  'tksjkl', 'fdctz', 'haiyun_oto', 'pcmzs', 'gyzzz', 'jtzs', 'haiyun', 'meitan_wym', 'xgxjtzs', 'CPI',
                  'M2', 'gtcl', 'meiyuan', 'jkk_qingdao', 'tegang_zonghe', 'WTI', 'tegang_tegang', 'meitan_ljm', 'fgzs',
                  'meitan_dlm']
table_name_meanings = {
    'jkk_qingdao': '青岛港进口矿现货',
    'jkk_qingdao_1': '青岛港进口矿现货价格',
    'steelprice': '各牌号钢材价格',
    'meitan_wym': '日照港喷吹无烟煤价格',
    'meitan_dlm': '山东动力煤价格',
    'meitan_ljm': '炼焦煤价格表',
    'xgxjtzs': '新干线焦炭指数',
    'WTI': 'WTI原油价格',
    'haiyun': '油轮海运指数',
    'meiyuan': '美元指数',
    'PMI': 'PMI指数',
    'psjgzs': '普氏价格指数',
    'tksykcl': '铁矿石原矿产量',
    'tksjkl': '铁矿石进口量',
    'gtcl': '钢铁产量',
    'pugang': '钢铁普刚指数',
    'tegang_zonghe': '特铁综合指数',
    'tegang_tegang': '特铁特钢指数',
    'tegang_ yougang': '特铁优刚指数',
    'tegang_buxiugang': '特铁不锈刚指数表',
    'lwgcl': '螺纹钢产量表',
    'CPI': 'CPI指数',
    'wymzs': '无烟煤指数表',
    'dlmzs': '动力煤指数',
    'pcmzs': '喷吹煤指数表',
    'ljmzs': '炼焦煤指数',
    'jtzs': '焦炭指数',
    'haiyun_oto': '海运运费',
    'fgzs': '废钢指数',
    'fdctz': '房地产资产投资额（月度）',
    'gdzctz': '固定资产投资额（月度）',
    'cugangyuedu': '全球粗钢月度产量',
    'gyzzz': '规模以上工业增加值（月度）',
    'rmbmyhl': '广义人民币名义有效汇率(ER)(月度)',
    'PPI': '生产者价格指数(PPI)、（每月）',
    'M2': '货币和准货币（M2）（月度）',
    'CRU': '国际钢铁综合价格指数(CRU)（月度）',
}
price_field = {
    'tkszs': 'tkszs_qdg',
    'meiyuan': 'meiyuan_zhishu',
    'steelprice': 'price',
    'meitan_ljm': 'coal_ljm_jiage',
    'jkk_qingdao': 'jkk_jizhunjia',
    'fgzs': 'fgzs_zhi',
    'gtcl': 'gangtie_gangcai',
}

time_fields = {
    'tkszs':'tkszs_date',
    'meiyuan':'meiyuan_date',
    'steelprice':'updatetime',
    'meitan_ljm':'coal_ljm_date',
    'jkk_qingdao':'jkk_date',
    'fgzs':'fgzs_date',
    'gtcl':'gangtie_date',
}